<template>
  <div class="app-container">
    <div style="display: flex;align-items: center;justify-content: center;font-size: 25px;font-weight: 500;">基于深度卷积网络的餐饮管理系统</div>
    <div>本系统功能设计：</div>
    <div>---------------------------------------------------------------------------------------------------------------------------------------------------------------------</div>
    <div>餐厅消费者</div>
    <div>1.通过系统的yolov5算法，将选择的菜品放到机器下通过摄像头识别自动算出菜品的价格，价格透明计算无误</div>
    <div>2.用户在机器计算出菜品的价格后，扫机器显示的二维码即可支付菜品的花费，方便快捷</div>
    <div>---------------------------------------------------------------------------------------------------------------------------------------------------------------------</div>
    <div>餐厅服务者</div>
    <div>1.当机器计算出餐厅消费者选择的菜品的价格后，会将菜品的价格显示给餐厅服务员确认价格，方便快捷</div>
    <div>2.机器打开计算餐厅服务者的当班时间，据服务者当班的时间内交易的次数，工钱奖惩计算准确无误</div>
    <div>3.机器统计出菜品中的畅销款，给予餐厅服务者购买畅销的菜品的原材料建议</div>
    <div>---------------------------------------------------------------------------------------------------------------------------------------------------------------------</div>
    <div>餐厅老板</div>
    <div>1.系统推出盈利日报，季报，年报，老板可以查看各个餐厅的盈利情况</div>
    <div>2.播报餐厅服务者的当班签到盈利情况，老板可以更清楚的知道每个服务者的动向，给予奖惩</div>
    <div>---------------------------------------------------------------------------------------------------------------------------------------------------------------------</div>
  </div>
</template>

<script>
export default {
  name: "Index",
  data() {
    return {
      // 版本号
      version: "3.8.7"
    };
  },
  methods: {
    goTarget(href) {
      window.open(href, "_blank");
    }
  }
};
</script>

<style scoped lang="scss">

</style>

